Repository: bpluta/Dogtector
Catalog: Dogtector/*.lproj/Localizable.strings
Languages: pl

# GlobalBack
source: Back
pl: Wróć

# GlobalClose
source: Close
pl: Zamknij

# GlobalEnable
source: Enable
pl: Włącz

# GlobalOrAlternative
source: Or
pl: Lub

# GlobalTryAgain
source: Try again
pl: Spróbuj ponownie

# GlobalContinue
source: Continue
pl: Kontynuuj

# GlobalUnknownError
source: Unknown error has occurred
pl: Wystąpił nieznany błąd

# CameraDetectionNotFound
source: Nothing found
pl: Nic nie znaleziono

# CameraProcessingState
source: Processing...
pl: Przetwarzanie...

# PermissionCameraAccessButtonTitle
source: Enable camera
pl: Uruchom aparat

# PermissionOpenSettingsButtonTitle
source: Open settings
pl: Otwórz ustawienia

# PermissionPickFromGalleryButtonTitle
source: Pick image from gallery
pl: Wybierz zdjęcie z galerii

# PermissionAllowAccessInfoMessage
source: Allowing the application to use the camera is necessary to take a photo or for live detection through the camera preview
pl: Zezwól na dostęp do aparatu, aby móc robić zdjęcia i rozpoznawać psy na żywo bezpośrednio przez podgląd aparatu

# PermissionOpenSettingsInfoMessage
source: In order to take photo and to perform live detection, please go to the system settings and allow the app to use the camera
pl: Aby móc robić zdjęcia i rozpoznawać psy na żywo, wejdź w ustawienia systemowe i zezwól na dostęp do aparatu

# SettingsOverlayFrameColor
source: Frame color
pl: Kolor ramki

# SettingsOverlayAnnotationSize
source: Annotation size
pl: Rozmiar adnotacji

# SettingsOverlayShowDetectionFrameSwitchTitle
source: Show detection frame
pl: Pokaż ramkę detekcji

# SettingsOverlayShowDetectionAnnotationSwitchTitle
source: Show detection annotation
pl: Pokaż adnotację detekcji

# SettingsOverlayLiveDetectionDisabledMessage
source: Live detection is disabled
pl: Detekcja na żywo jest wyłączona

# CameraSonfigurationFailureMessage
source: Camera configuration has failed
pl: Konfiguracja aparatu nie powiodła się

# ImageSavedSuccessMessage
source: Image has been saved
pl: Zdjęcie zostało zapisane

# ImageProcessingFailureMessage
source: Image could not be processed properly
pl: Wystąpił błąd podczas przetwarzania obrazu

# ImageTakeFailureMessage
source: Could not take a photo
pl: Nie udało się zrobić zdjęcia

# FlashTriggerFailureMessage
source: Flash could not be switched
pl: Wystąpił błąd podczas przełączania lampy błyskowej

# DetectorSetupFailureMessage
source: Detector configuration has failed
pl: Wystąpił błąd przy konfiguracji detektora

# SystemSettingsOpenFailureMessage
source: System settings could not be opened
pl: Wystąpił bład podczas otwierania ustawień systemowych

# LiveDetectionHasBeenEnabled
source: Live detection on
pl: Detekcja na żywo wł.

# LiveDetectionHasBeenDisabled
source: Live detection off
pl: Detekcja na żywo wył.

# FlashHasBeenEnabled
source: Flash on
pl: Lampa błyskowa wł.

# FlashHasBeenDisabled
source: Flash off
pl: Lampa błyskowa wył.

# ImageProcessingSaveError
source: Image could not be saved
pl: Zapisywanie zdjęcia nie powiodło się

# ImageProcessingNotAuthorizedError
source: Access to photos has been denied
pl: Brak uprawnień dostępu do zdjęć

# CameraTakeImageError
source: Could not take a photo
pl: Nie udało się zrobić zdjęcia

# CameraNotAuthorizedError
source: Access to camera has been denied
pl: Brak uprawnień dostępu do aparatu

# SettingsTitle
source: Settings
pl: Ustawienia

# SettingsPreferencesSectionTitle
source: Preferences
pl: Preferencje

# SettingsLiveDetectionSwitchTitle
source: Enable live detection
pl: Włącz detekcję na żywo

# SettingsLiveDetectionSwitchDescription
source: When disabled you can still detect dogs by taking a photo or by picking image from gallery
pl: Kiedy wyłączysz detekcję na żywo możesz dalej korzystać z detekcji po wybraniu zdjęcia z galerii lub po zrobieniu zdjęcia aparatem

# SettingsDonationTitle
source: Support the creator
pl: Wesprzyj twrórcę

# SettingsAboutAppTitle
source: About application
pl: O aplikacji

# SettingsRateAppTitle
source: Rate application
pl: Oceń aplikację

# SettingsResetToDefaultsTitle
source: Restore settings
pl: Przywróć ustawienia

# SettingsShareAppTitle
source: Share application
pl: Udostępnij aplikację

# SettingsHelpTitle
source: Help
pl: Pomoc

# SettingsShareSheetErrorMessage
source: Share sheet could not be presented
pl: Wystąpił błąd podczas wyświetlania menu udostępniania

# SettingsRestoreAlertTitle
source: Restore settings
pl: Przywróć ustawienia

# SettingsRestoreAlertQuestion
source: Do you want to restore the application to default settings?
pl: Czy chcesz przywrócić aplikację do ustawień fabrycznych?

# SettingsRestoreAlertProceedButtonTitle
source: Restore
pl: Przywróć

# SettingsRestoreSuccessMessage
source: App has been restored to the default settings
pl: Aplikacja została odtworzona do ustawień fabrycznych

# LowPowerModeSheetTitle
source: Low power mode
pl: Tryb niskiego zużycia energii

# LowPowerModeSheetSubtitle
source: Your device runs in the low power mode which reduces speed of live detection
pl: Twoje urządzenie działa w trybie niskiego zużycia energii, który powoduje wolniejsze działanie detekcji w tybie "na żywo"

# LowPowerModeSheetCaption
source: If you want to preserve the battery – turn off the live detection mode and perform detection by taking photos or by picking images from the gallery
pl: Jeśli chcesz oszczędzać baterię – wyłącz detekcję "na żywo" i korzystaj z detekcji przez zrobienie zdjęcia lub przez wybranie zdjęcia z galerii

# LowPowerModeSheetEnableLiveDetectionSwitchTitle
source: Live detection
pl: Detekcja na żywo

# DetectionObservationTitle
source: Observation %@
pl: Obserwacja %@

# DetectionDetailsAllObservationsTitle
source: Observations
pl: Obserwacje

# DetectionDetailsSingleObservationTitle
source: Details
pl: Szczegóły

# LicencesTitle
source: Licences
pl: Licencje

# AboutVersionDescription
source: Version %@
pl: Wersja %@

# AboutDescription
source: Dogtector has been developed as hobbystic project and is a result of few hundred hours of work of just one person on both aplication and artificial intelligence. Whoever you are, I would like to thank you for downloading Dogtector and I hope you enjoy using it as much as I have during creation of this application, Bart
pl: Dogtector powstał jako projekt hobbystyczny i jest rezultatem kilkuset godzin jednoosobowej pracy nad aplikacją oraz nad sztuczną inteligencją. Kimkolwiek jesteś, dziękuję za pobranie Dogtectora i mam nadzieję, że sprawi Ci tyle przyjemności, ile mi sprawiło tworzenie tej aplikacji, Bartek

# AboutSendDonationTitle
source: Support the creator
pl: Wesprzyj twórcę

# AboutLicencesTitle
source: Licences
pl: Licencje

# AboutCopyDebugData
source: Copy debug data
pl: Skopiuj dane do debugowania

# AboutDedicationInfoTitle
source: Dedicated to Sammy
pl: Dla Smmmy'ego

# AboutDedicationInfoDescripton
source: The best guide to Koh Phangan
pl: Najlepszego przewodnika po Koh Phangan

# AboutDebugDataCopySuccessMessage
source: Debug data has been copied
pl: Dane do debugowania zostały skopiowane

# AboutDebugDataCopyFailureMessage
source: Debug data could not be copied
pl: Danie nie mogły zostać skopiowane

# AboutUnknownSystemVersion
source: Unknown
pl: Nieznana

# ObjectDetailsAlternativeNamesHeaderTitle
source: Alternative names
pl: Inne nazwy

# ObjectDetailsOriginCountriesHeaderTitle
source: Origin
pl: Pochodzenie

# ObjectDetailsLearnMoreButtonTitle
source: Learn more
pl: Dowiedz się więcej

# ObjectDetailsDetectionAccuracyInfo
source: Detection confidence %@
pl: Pewność detekcji %@

# ObjectDetailsNoNameTitle
source: Unknown
pl: Nieznany

# WelcomeSceneWelcomeTitle
source: Welcome to
pl: Witaj

# WelcomeSceneWelcomeAppName
source: Dogtector
pl: w Dogtectorze

# WelcomeScemeLiveDetectionTitle
source: Live detection
pl: Detekcja na żywo

# WelcomeScemeLiveDetectionDescrption
source: Simply point the camera onto a dog and the app will instantly help you to recognize its breed
pl: Nakieruj aparat na psa, a aplikacja natychmiast pomoże Ci rozpoznać jego rasę

# WelcomeSceneDiscoverTitle
source: Discover new breeds
pl: Odkrywaj nowe psy

# WelcomeSceneDiscoverDescription
source: The app is capable of classifying more than 400 different breeds of dogs
pl: Aplikacja potrafi odróżniać ponad 400 różnych ras psów

# WelcomeScenePrivacyTitle
source: On-device detection
pl: Detekcja bezpośrednio na urządzeniu

# WelcomeScenePrivacyDescription
source: Dogtector does not collect any data from you – what happens on your device, stays on your device
pl: Dogtector nie zbiera od Ciebie żadnych danych – co dzieje się na Twoim urządzeniu, zostaje na Twoim urządzeniu

# TipJarPromptTitle
source: Support the creator
pl: Wesprzyj twórcę

# TipJarPromptDescription
source: Dogtector is 100% free application and is developed and maintained by just one person. If you liked the app, please consider sending me a tip to support further development of the project. Thank you!
pl: Dogtector jest zupełnie darmową aplikacją tworzoną hobbystycznie przez jedną osobę. Jeśli aplikacja Ci się spodobała, rozważ zostawienie mi napiwku w celu wsparcia dalszego rozwoju projektu. Dziękuję!

# TipJarSuccessMessage
source: Thank you for your support!
pl: Dziękuję za Twoje wsparcie!

# TipJarDoNotShowAgainSwitchTitle
source: Do not show again
pl: Nie pokazuj ponownie

# TipJarFetchErrorDescription
source: Available support options could not be loaded properly
pl: Wystąpił problem z pobraniem dostępnych opcji wsparcia

# TipJarNiceGestureTipTitle
source: Nice gesture 🧃
pl: Miły gest 🧃

# TipJarNiceGestureTipDescription
source: Your gesture will help me to develop this app. Thank you!
pl: Twój gest pomoże mi w rozwoju tej aplikacji. Dziękuję!

# TipJarGreatHelpTipTitle
source: Great help 🍰
pl: Duża pomoc 🍰

# TipJarGreatHelpTipDescription
source: I really appreciate your help and support. You’re awesome!
pl: Bardzo doceniam Twoją pomoc i wsparcie. Jesteś super!

# TipJarAmazingSupportTipTitle
source: Amazing support 🍕
pl: Wielkie wsparcie 🍕

# TipJarAmazingSupportTipDescription
source: This level of support means a lot for me. Thank you for being so generous!
pl: Ten poziom wsparcia znaczy dla mnie bardzo wiele. Dziękuję za Twoją hojność!

# InAppPurchaseNoProductIdFoundError
source: No product identifiers found
pl: Nie znaleziono identyfikatorów produktów

# InAppPurchaseNoProductsFoundError
source: No products found
pl: Nie znaleziono żadnych produktów

# InAppPurchaseProductRequestFailedError
source: Could not fetch available products
pl: Pobieranie produktów nie powiodło się

# InAppPurchasePaymentWasCancelledError
source: Purchase process has been cancelled
pl: Proces płatności został anulowany

# InAppPurchaseNoPurchasesToRestoreError
source: No items to restore
pl: Brak produktów do przywrócenia

# InAppPurchaseNotAllowedtoMakePurchasesError
source: Not permitted to make purchases
pl: Brak uprawnień do wykonywania płatności

# InAppPurchaseOtherTransactionError
source: Could not process the purchase
pl: Wystąpił bład podczas płatności

# FAQBreedAmountQuestion
source: How many dog breeds are supported by the application for detection?
pl: Jak wiele ras jest rozróżnianych przez aplikację?

# FAQBreedAmountAnswer
source: At present, the artificial intelligence behind the detection mechanism is capable of classifying 417 different dog breeds.
pl: Obecnie, sztuczna inteligencja, na której oparta jest detekcja w aplikacji, jest zdolna do wykrywania 417 róznych ras psów.

# FAQLiveDetectionDisabledQuestion
source: Can I detect dog with live detection turned off?
pl: Czy mogę korzystać z detekcji po wyłączeniu trybu "na żywo"?

# FAQLiveDetectionDisabledAnswer
source: Yes, when you turn the live detction off, you are still able to detect dogs by picking image from gallery or by taking photo with the camera.
pl: Tak, kiedy wyłączysz detekcję na żywo, dalej możesz korzystać z detekcji robiąc zdjęcia lub wybierając je z galerii.

# FAQReliabilityQuestion
source: How reliable do detection results are?
pl: Jak dokładne są wyniki detekcji?

# FAQReliabilityAnswer
source: Displayed detections are the result of image processing by artificial intelligence and even though in many cases they look correct, the most suggested response may not always be correct one, especially when visual differences between breeds are minimal or when dog is not well visible. That is why given detections should be treated only as suggestions.
pl: Wyświetlane obserwacje są rezultatem interpretacji obrazu przez sztuczną inteligencję. Mimo że dla wielu przypadków zwracane wyniki wyglądają na poprawne, to nie zawsze najbardziej sugerowana rasa będzie tą właściwą – w szczególności, gdy różnice wizualne między rasami psów są niewielkie lub, gdy pies nie jest dobrze widoczny. Z tego powodu, przezentowane wyniki powinny być traktowane wyłącznie jako sugestie.

# FAQBestResultsQuestion
source: What can I do to get the best results?
pl: Jak mogę uzyskać najlepsze wyniki?

# FAQBestResultsAnswer
source: To get the most accurate results, the image should be sharp, motionless and should expose the most distinctive parts of a dog such as head and torso. Ideally, the dog should take at least 1/4 of image size and should not go beyond its boundaries.
pl: Aby uzyskać najlepsze wyniki obraz powinien być ostry, nieporuszony i musi dobrze eksponować charkterystyczne części psa, takie jak głowa czy tors. Najlepiej, aby pies na zdjęciu był wielkości minimum 1/4 całego zdjęcia i jednocześnie nie wykraczał poza granice jego ramek.

# FAQMixedBreedsQuestion
source: Do results show possible breed mixes?
pl: Czy wyniki pokazują potencjalne mieszanki ras?

# FAQMixedBreedsAnswer
source: No, model is not capable of determining if dog is mixture of different breeds. Other breeds shown on the list are just other breed guesses suggested by the artificial intelligence.
pl: Nie, sztuczna inetligencja odpowiedzialna za detekcję w aplikacji nie jest w stanie określić czy dany pies jest mieszanką innych ras. Inne rasy pokazane na liście obserwacji są kolejnymi domysłami sugerowanymi przez sztuczną inteligencję.

# FAQDeniedPermissionQuestion
source: How to fix permission denied error?
pl: Jak naprawić błąd braku pozwolenia na dostęp do kamery lub zdjęć?

# FAQDeniedPermissionAnswer
source: The only way to change the permissions after denial is to open the system settings and scroll down to find Dogtector settings page and set your permissions there.
pl: Jedynym sposobem na zmianę uprawnień aplikacji jest otwarcie ustawień systemowych i odszukanie zakładki ustawień aplikacji Dogtector – znajdują się tam wszystkie opcje związane ze zmianą uprawnień aplikacji.

# FAQSlowDetectionQuestion
source: Why does live detection work so slow for me?
pl: Dlaczego detekcja na żywo działa u mnie tak wolno?

# FAQSlowDetectionAnswer
source: In some scenarios, live detection may work slower than expected. For instance, it may happen when your device has low power mode enabled or when it is overheated. However some devices are not capable of performing live detection fast enough due to hardware limitations. The feature works best with devices loaded with Apple Neural Engine chip which accelerates processing of neural networks (iPhone XS and newer).
pl: W pewnych okolicznościach detekcja na żywo może działać wolniej, niż można tego oczekiwać. Przykładowo, może się tak dziać wtedy, kiedy włączony jest tryb niskiego zużycia energii lub, gdy urządzenie przegrzewa się. Jednakże, niektóre urządzenia nie są w stanie sprzętowo przeprowadzać detekcji odpowiednio szybko. Funkcja ta działa najlepiej i najszybciej z urządzeniami z wbudowanym chipem Apple Neural Engine przyspieszającym przetwarzanie sieci neuronowych (iPhone'y XS i nowsze).
